<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"89d1f2ba0c1328a844052b835253e8a90325471d46eae9afb17ce512a00eebf4","plan_job_ref":"Job Terraform Plan #35 at https://github.com/amc40/NextJS-Boilerplate/actions/runs/6764367099","plan_hash":"6f2b980a2dd6903e1a100e1484f2b716da4b9ff7e9e31598f9098ee22cd0b347","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
github_repository_name = "NextJS-Boilerplate"
vercel_api_token       = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vercel_project_custom.vercel_project.vercel_project_with_github will be created
  + resource "vercel_project" "vercel_project_with_github" {
      + framework                               = "nextjs"
      + git_repository                          = {
          + production_branch = (known after apply)
          + repo              = "amc40/NextJS-Boilerplate"
          + type              = "github"
        }
      + id                                      = (known after apply)
      + name                                    = "nextjs-boilerplate"
      + protection_bypass_for_automation_secret = (known after apply)
      + serverless_function_region              = "lhr1"
      + team_id                                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform Apply #1](https://github.com/amc40/NextJS-Boilerplate/actions/runs/6764387124)